conf/src/Catalogs/ЭП_СтатусыЗадач/ЭП_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_СтатусыЗадач</name>
  <owners>Catalog.Проекты</owners>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_НаборыСтатусов/ЭП_НаборыСтатусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_НаборыСтатусов</name>
  <owners>Catalog.Проекты</owners>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.ЭП_СтатусыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_СтатусыЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Проект.Пустая() Тогда
		Объект.Владелец = Параметры.Проект;
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаписыватьСтатусВНабор = Истина;
	КонецЕсли;  
	
	Если Параметры.НеДобавлятьСтатусВНабор Тогда
		ЗаписыватьСтатусВНабор = Ложь;
	КонецЕсли;
	
	Если Не Параметры.Владелец = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка") Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗаписыватьСтатусВНабор Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_НаборыСтатусов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭП_НаборыСтатусов КАК ЭП_НаборыСтатусов
	|ГДЕ
	|	ЭП_НаборыСтатусов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПараметрыОтбора = Новый Структура("Статус", Объект.Ссылка); 
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеНабора = Выборка.Ссылка.ПолучитьОбъект(); 
		
		Если ДанныеНабора.Статусы.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда 
			
			НоваяСтрока = ДанныеНабора.Статусы.Добавить(); 
			НоваяСтрока.Статус = Объект.Ссылка;
			
		КонецЕсли;
		
		ДанныеНабора.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИмяСправочника()
	Возврат Объект.Ссылка.Метаданные().Имя;	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИмяОбъекта = ПолучитьИмяСправочника();
    СтрРеквизитов = Новый Структура; 
    СтрРеквизитов.Вставить("Наименование", Объект.Наименование);
	СтрРеквизитов.Вставить("Владелец", Объект.Владелец);
	
	Если Не ЭП_ОбщегоНазначенияСервер.ПроверитьУникальностьОбъектаПоРеквизитам("Справочник", ИмяОбъекта, СтрРеквизитов, Объект.Ссылка) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подобный элемент справочника «" + Объект.Наименование + "» существует!
                |Модуль: Контроль уникальности элементов справочника." );
        Отказ = Истина; 
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
